app/controllers/departments_controller.rb

  def show
    @products_by_department = Product.where("id_department = ?", params[:id])
---
SELECT  "departments".* FROM "departments" WHERE (7) LIMIT ?  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE (id_department = '1')

  def create
    @department = Department.new (department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2019-05-20 17:19:37.228540"], ["updated_at", "2019-05-20 17:19:37.228540"]]

  def update
    respond_to do |format|
      if @department.update (department_params)
---
UPDATE "departments" SET "name" = ?, "updated_at" = ? WHERE "departments"."id" = ?  [["name", "test154"], ["updated_at", "2019-05-21 15:04:09.893666"], ["id", 4]]

  def destroy
    @department.destroy
---
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 2]]

  def set_department
    @department = Department.find_by(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE (7) LIMIT ?  [["LIMIT", 1]]