app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."name" ASC LIMIT ?  [["LIMIT", 5]]
SELECT  "products".* FROM "products" ORDER BY "products"."price" ASC LIMIT ?  [["LIMIT", 1]]
---
	def index
		@products = Product.order(name: :asc).limit 4
		@product_with_discount = Product.order(:price).limit 1

SELECT "departments".* FROM "departments"
---
	def new
		@product = Product.new
		@departments = Department.all

UPDATE "products" SET "id_department" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["id_department", 24], ["updated_at", "2019-05-23 13:01:57.973834"], ["id", 7]]
---
	def update
		if @product.update(product_params)

INSERT INTO "products" ("name", "desc", "price", "amount", "created_at", "updated_at", "id_department") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "produto 1"], ["desc", "teste"], ["price", 123.0], ["amount", 1], ["created_at", "2019-05-22 14:29:44.917821"], ["updated_at", "2019-05-22 14:29:44.917821"], ["id_department", 8]]
---
	def create
		@product = Product.new(product_params)
		if @product.save

SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 1]]
---
	def search
		@name = params[:name]
		@products = Product.where "name like ?", "%#{@name}%"

SELECT  "products".* FROM "products" WHERE (6) LIMIT ?  [["LIMIT", 1]]
---
	def set_product
		@product = Product.find_by(params[:id])